import React from 'react';

interface AboutProps {}

export default function About({}: AboutProps) {
  const texts = [
    {
      title: 'Про нас',
      text: 'Наші майстри з багаторічним досвідом досконало оволоділи техніками різних кулінарних напрямків і незмінно дотримуються перевірених часом рецептів. Приготувати кулінарний шедевр в авторському стилі їм не складе труднощів, але тільки якщо ви цього побажаєте.',
    },
    {
      title: 'Готуємо з найкращих інгредієнтів',
      text: 'Візитна картка NinjaSushi- свіжість і насичений смак. Подібного ефекту вдається досягти завдяки найякіснішим інгредієнтам, які щодня надходять на кухню від надійних постачальників. У наших правилах не економити на обсязі порцій і не використовувати заморожені продукти.',
    },
  ];
  return (
    <ul className="flex flex-col gap-24 ">
      {texts.map(text => (
        <li key={text.title}>
          <h2 className="mb-4 text-[#1D1D1F] font-bold text-4xl">
            {text.title}
          </h2>
          <p className="text-[#686870] text-base">{text.text}</p>
        </li>
      ))}
    </ul>
  );
}
